test/Billing.Test/Resources/Events/customer.subscription.updated.json

{
  "id": "evt_1NvLMDIGBnsLynRr6oBxebrE",
  "object": "event",
  "api_version": "2024-06-20",
  "created": 1695911902,
  "data": {
    "object": {
      "id": "sub_1NvKoKIGBnsLynRrcLIAUWGf",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1695911900,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "charge_automatically",
      "created": 1695909804,
      "currency": "usd",
      "current_period_end": 1727534300,
      "current_period_start": 1695911900,
      "customer": "cus_OimNNCC3RiI2HQ",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_OimNgVtrESpqus",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1695909805,
            "metadata": {
            },
            "plan": {
              "id": "enterprise-org-seat-annually",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 3600,
              "amount_decimal": "3600",
              "billing_scheme": "per_unit",
              "created": 1494268677,
              "currency": "usd",
              "interval": "year",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "2019 Enterprise Seat (Annually)",
              "product": "prod_BUtogGemxnTi9z",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "enterprise-org-seat-annually",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1494268677,
              "currency": "usd",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": "2019 Enterprise Seat (Annually)",
              "product": "prod_BUtogGemxnTi9z",
              "recurring": {
                "aggregate_usage": null,
                "interval": "year",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 3600,
              "unit_amount_decimal": "3600"
            },
            "quantity": 1,
            "subscription": "sub_1NvKoKIGBnsLynRrcLIAUWGf",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1NvKoKIGBnsLynRrcLIAUWGf"
      },
      "latest_invoice": "in_1NvLM9IGBnsLynRrOysII07d",
      "livemode": false,
      "metadata": {
        "organizationId": "84a569ea-4643-474a-83a9-b08b00e7a20d"
      },
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "enterprise-org-seat-annually",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 3600,
        "amount_decimal": "3600",
        "billing_scheme": "per_unit",
        "created": 1494268677,
        "currency": "usd",
        "interval": "year",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "2019 Enterprise Seat (Annually)",
        "product": "prod_BUtogGemxnTi9z",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1695909804,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": 1695911899,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": 1695909804
    },
    "previous_attributes": {
      "billing_cycle_anchor": 1696514604,
      "current_period_end": 1696514604,
      "current_period_start": 1695909804,
      "latest_invoice": "in_1NvKoKIGBnsLynRrSNRC6oYI",
      "status": "trialing",
      "trial_end": 1696514604
    }
  },
  "livemode": false,
  "pending_webhooks": 8,
  "request": {
    "id": "req_DMZPUU3BI66zAx",
    "idempotency_key": "3fd8b4a5-6a20-46ab-9f45-b37b02a8017f"
  },
  "type": "customer.subscription.updated"
}
